{
    "backend": "tensorflow",
    "class_name": "Sequential",
    "config": {
        "layers": [
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "batch_input_shape": [
                        null,
                        128,
                        2
                    ],
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1",
                    "padding": "valid",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                }
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv2",
                    "padding": "valid",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                }
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "max_pooling1d",
                    "padding": "valid",
                    "pool_size": [
                        2
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                }
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv3",
                    "padding": "valid",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                }
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv4",
                    "padding": "valid",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "dtype": "float32",
                    "name": "dropout",
                    "noise_shape": null,
                    "rate": 0.5,
                    "seed": null,
                    "trainable": true
                }
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv5",
                    "padding": "valid",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                }
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv6",
                    "padding": "valid",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "dtype": "float32",
                    "name": "dropout_1",
                    "noise_shape": null,
                    "rate": 0.5,
                    "seed": null,
                    "trainable": true
                }
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "max_pooling1d_1",
                    "padding": "valid",
                    "pool_size": [
                        2
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                }
            },
            {
                "class_name": "Flatten",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "flatten",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "truncated_normal",
                            "mode": "fan_in",
                            "scale": 2.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense1",
                    "trainable": true,
                    "units": 128,
                    "use_bias": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "truncated_normal",
                            "mode": "fan_in",
                            "scale": 2.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense2",
                    "trainable": true,
                    "units": 11,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "softmax",
                    "dtype": "float32",
                    "name": "activation",
                    "trainable": true
                }
            }
        ],
        "name": "sequential"
    },
    "keras_version": "2.2.4-tf"
}
